app/Controllers/Artikel.php

    public function adminIndex()
{
    $q = $this->request->getVar('q') ?? '';
    $kategori_id = $this->request->getVar('kategori_id') ?? '';
    $page = $this->request->getVar('page') ?? 1;

    $builder = $this->artikelModel
        ->select('artikel.*, kategori.nama_kategori')
        ->join(
            'kategori',
            'kategori.id_kategori = artikel.id_kategori',
            'left'
        );

    if ($q != '') {
        $builder->like('artikel.judul', $q);
    }

    if ($kategori_id != '') {
        $builder->where('artikel.id_kategori', $kategori_id);
    }

    $artikel = $builder->paginate(5, 'default', $page);
---
SELECT COUNT(*) AS `numrows`
FROM `artikel`
LEFT JOIN `kategori` ON `kategori`.`id_kategori` = `artikel`.`id_kategori`
WHERE `artikel`.`judul` LIKE '%artikel 5%' ESCAPE '!'
SELECT `artikel`.*, `kategori`.`nama_kategori`
FROM `artikel`
LEFT JOIN `kategori` ON `kategori`.`id_kategori` = `artikel`.`id_kategori`
WHERE `artikel`.`judul` LIKE '%artikel 5%' ESCAPE '!'
 LIMIT 5

    }

    $kategoriModel = new KategoriModel();
    $data['kategori'] = $kategoriModel->findAll();
---
SELECT *
FROM `kategori`

    public function edit($id)
{
    $data['artikel'] = $this->artikelModel->find($id);

    if (!$data['artikel']) {
        throw \CodeIgniter\Exceptions\PageNotFoundException::forPageNotFound();
    }

    $kategoriModel = new KategoriModel();
    $data['kategori'] = $kategoriModel->findAll();
---
SELECT *
FROM `artikel`
WHERE `artikel`.`id` = '12'
SELECT *
FROM `kategori`