app/Controllers/Post.php

public function show($id = null)
{
    $model = new ArtikelModel();

    $data = $model->find($id);
---
SELECT *
FROM `artikel`
WHERE `artikel`.`id` = '1'

public function create()
{
    $model = new ArtikelModel();

    $data = [
        'judul' => $this->request->getVar('judul'),
        'isi'   => $this->request->getVar('isi')
    ];

    $model->insert($data);
---
INSERT INTO `artikel` (`judul`, `isi`) VALUES ('Artikel API', 'Belajar Thunder Client')

public function delete($id = null)
{
    $model = new ArtikelModel();

    if (!$model->find($id)) {
        return $this->failNotFound('Data tidak ditemukan');
    }

    $model->delete($id);
---
SELECT *
FROM `artikel`
WHERE `artikel`.`id` = '16'
DELETE FROM `artikel`
WHERE `id` IN ('16')